from pyrogram import filters

from MukeshRobot import pbot
from MukeshRobot.utils.errors import capture_err
from MukeshRobot.modules.helper_funcs.misc import is_module_loaded

__mod_name__ = "ᴍᴜᴛɪɴɢ"

__help__ = """
**ᴍᴜᴛɪɴɢ**

Aᴅᴍɪɴ ᴏɴʟʏ:
• /ᴍᴜᴛᴇ: Mᴜᴛᴇ ᴛʜᴇ ᴜsᴇʀ ʀᴇᴘʟɪᴇᴅ ᴛᴏ ᴏʀ ᴍᴇɴᴛɪᴏɴᴇᴅ.
• /sᴍᴜᴛᴇ: sɪʟᴇɴᴄᴇs ᴀ ᴜsᴇʀ ᴡɪᴛʜᴏᴜᴛ ɴᴏᴛɪғʏɪɴɢ. Cᴀɴ ᴀʟsᴏ ʙᴇ ᴜsᴇᴅ ᴀs ᴀ ʀᴇᴘʟʏ, ᴍᴜᴛɪɴɢ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴏ ᴜsᴇʀ.
• /ᴅᴍᴜᴛᴇ: Mᴜᴛᴇ ᴀ ᴜsᴇʀ ʙʏ ʀᴇᴘʟʏ, ᴀɴᴅ ᴅᴇʟᴇᴛᴇ ᴛʜᴇɪʀ ᴍᴇssᴀɢᴇ.
• /ᴛᴍᴜᴛᴇ <ᴜsᴇʀʜᴀɴᴅʟᴇ> x(ᴍ/ʜ/ᴅ): ᴍᴜᴛᴇs ᴀ ᴜsᴇʀ ғᴏʀ x ᴛɪᴍᴇ. (ᴠɪᴀ ʜᴀɴᴅʟᴇ, ᴏʀ ʀᴇᴘʟʏ). ᴍ = ᴍɪɴᴜᴛᴇs, ʜ = ʜᴏᴜʀs, ᴅ = ᴅᴀʏs.
• /sᴛᴍᴜᴛᴇ <ᴜsᴇʀʜᴀɴᴅʟᴇ> x(ᴍ/ʜ/ᴅ): ᴍᴜᴛᴇs ᴀ ᴜsᴇʀ ғᴏʀ x ᴛɪᴍᴇ ᴡɪᴛʜᴏᴜᴛ ɴᴏᴛɪғʏɪɴɢ. (ᴠɪᴀ ʜᴀɴᴅʟᴇ, ᴏʀ ʀᴇᴘʟʏ). ᴍ = ᴍɪɴᴜᴛᴇs, ʜ = ʜᴏᴜʀs, ᴅ = ᴅᴀʏs.
• /ᴅᴛᴍᴜᴛᴇ <ᴜsᴇʀʜᴀɴᴅʟᴇ> x(ᴍ/ʜ/ᴅ): Mᴜᴛᴇ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴜsᴇʀ, ᴀɴᴅ ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ʀᴇᴘʟɪᴇᴅ ᴍᴇssᴀɢᴇ. (ᴠɪᴀ ʀᴇᴘʟʏ). ᴍ = ᴍɪɴᴜᴛᴇs, ʜ = ʜᴏᴜʀs, ᴅ = ᴅᴀʏs.
• /ᴜɴᴍᴜᴛᴇ: Uɴᴍᴜᴛᴇs ᴛʜᴇ ᴜsᴇʀ ᴍᴇɴᴛɪᴏɴᴇᴅ ᴏʀ ʀᴇᴘʟɪᴇᴅ ᴛᴏ.

Exᴀᴍᴘʟᴇ:
/ᴍᴜᴛᴇ @ᴜsᴇʀɴᴀᴍᴇ; ᴛʜɪs ᴍᴜᴛᴇs ᴀ ᴜsᴇʀ."""
