from pyrogram import filters

from MukeshRobot import pbot
from MukeshRobot.utils.errors import capture_err
from MukeshRobot.modules.helper_funcs.misc import is_module_loaded

__mod_name__ = "ᴏᴡɴᴇʀ"

__help__ = """
**ᴏᴡɴᴇʀ sᴜᴅᴏ ᴜsᴇʀ  ᴄᴏᴍᴍᴀɴᴅs**

Oᴡɴᴇʀ's ᴄᴏᴍᴍᴀɴᴅs:
• /ʀᴇsᴛᴀʀᴛ : Rᴇsᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ
• /ᴜᴘᴅᴀᴛᴇ : Tᴏ ᴜᴘᴅᴀᴛᴇ ᴛʜᴇ ʙᴏᴛ ᴡɪᴛʜ ᴛʜᴇ ᴍᴀɪɴ sᴛʀᴇᴀᴍ ʀᴇᴘᴏ

Dᴇᴠ's ᴄᴏᴍᴍᴀɴᴅs:
• /ᴀᴅᴅsᴜᴘᴘᴏʀᴛ [ᴅᴇᴠ | sᴜᴅᴏ | ᴡʜɪᴛᴇʟɪsᴛ] : Rᴇᴘʟʏ ᴛᴏ ᴍᴇssᴀɢᴇ ᴏʀ ɢɪᴠᴇ ᴍᴇ ᴜsᴇʀ ɪᴅ ᴏʀ ᴜsᴇʀɴᴀᴍᴇ
• /ʟᴏɢs : Rᴇᴛᴜʀɴ ᴛʜᴇ ʟᴏɢs ᴏғ ʙᴏᴛ.
• /ɴᴇᴏғᴇᴛᴄʜ : Fᴇᴛᴄʜ ɴᴇᴏ.
• /ᴇᴠᴀʟ : Eᴠᴀʟᴜᴀᴛᴇ ᴛʜᴇ ɢɪᴠᴇɴ ᴘʏᴛʜᴏɴ ᴄᴏᴅᴇ.
• /ᴇxᴇᴄ : Exᴇᴄᴜᴛᴇ ᴛʜᴇ ɢɪᴠᴇɴ ᴄᴏᴅᴇ.
• /ᴄʜᴀᴛʟɪsᴛ : Rᴇᴛᴜʀɴ ᴛʜᴇ ʟɪsᴛ ᴏғ ᴄʜᴀᴛs ᴘʀᴇsᴇɴᴛ ɪɴ ᴅᴀᴛᴀʙᴀsᴇ
• /ᴜᴘᴛɪᴍᴇ : Rᴇᴛᴜʀɴ ᴛʜᴇ ᴜᴘᴛɪᴍᴇ ᴏғ ᴛʜᴇ ʙᴏᴛ.
• /ʟᴇᴀᴠᴇᴄʜᴀᴛ : Bᴏᴛ ᴡɪʟʟ ʟᴇᴀᴠᴇ ᴛʜᴇ ᴘʀᴏᴠɪᴅᴇᴅ ᴄʜᴀᴛ.
• /ᴄʜᴀᴛʙʀᴏᴀᴅᴄᴀsᴛ : Bʀᴏᴀᴅᴄᴀsᴛ ᴛʜᴇ ᴍᴇssɢᴇ ᴛᴏ ᴄʜᴀᴛs.
• /ғᴏʀᴡᴀʀᴅ (/ғᴡᴅ) [ᴛᴀɢ] : Fᴏʀᴡᴀʀᴅ ᴍᴇssᴀɢᴇ ᴛᴏ ᴘᴇᴇʀs ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ᴛᴀɢ. Dᴇғᴀᴜʟᴛ ᴛᴏ ᴀʟʟ
    Aᴠᴀɪʟᴀʙʟᴇ ᴛᴀɢs:
     -ᴜ : Fᴏʀ ᴜsᴇʀs
     -ᴄ : Fᴏʀ ᴄʜᴀᴛs
     -ᴀʟʟ : Fᴏʀ ᴀʟʟ

Sᴜᴅᴏᴇʀ's ᴄᴏᴍᴍᴀɴᴅ:
• /ᴘɪɴɢ : ʀᴇᴛᴜʀɴ ᴛʜᴇ ᴘɪɴɢ ᴏғ ᴛʜᴇ ʙᴏᴛ.
• /ᴄʟᴇᴀɴᴅʙ : Dᴇʟᴇᴛᴇ ᴜsᴇʟᴇss ᴊᴜɴᴋs ғʀᴏᴍ ᴅᴀᴛᴀʙᴀsᴇ (Aᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ sᴛᴀʀᴛ ᴄʟᴇᴀɴɪɴɢ ɪᴛ ᴀᴛ 3:00:00 AM)

Exᴀᴍᴘʟᴇ:
/ᴘɪɴɢ

"""
