from pyrogram import filters

from MukeshRobot import pbot
from MukeshRobot.utils.errors import capture_err
from MukeshRobot.modules.helper_funcs.misc import is_module_loaded

__mod_name__ = "ᴘɪɴss"

__help__ = """
**Pɪɴ**

Hᴇʀᴇ ʏᴏᴜ ғɪɴᴅ ғɪɴᴅ ᴀʟʟ ʜᴇʟᴘ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ ɢʀᴏᴜᴘs ᴘɪɴs ᴀɴᴅ ʜᴏᴡ ᴛᴏ ᴍᴀɴᴀɢᴇ ᴛʜᴇᴍ ᴠɪᴀ ᴍᴇ.

Aᴅᴍɪɴ Cᴍᴅs:
• /ᴘɪɴ: Sɪʟᴇɴᴛʟʏ ᴘɪɴs ᴛʜᴇ ᴍᴇssᴀɢᴇ ʀᴇᴘʟɪᴇᴅ ᴛᴏ - ᴀᴅᴅ ʟᴏᴜᴅ, ɴᴏᴛɪғʏ ᴏʀ ᴀʟᴇʀᴛ ᴛᴏ ɢɪᴠᴇ ɴᴏᴛɪғɪᴄᴀᴛᴏɴ ᴛᴏ ᴜsᴇʀs.
• /ᴜɴᴘɪɴ: Uɴᴘɪɴs ᴛʜᴇ ʟᴀsᴛ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ.
• /ᴘɪɴɴᴇᴅ: Gɪᴠᴇs ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ ᴏғ ᴛʜᴇ ᴄʜᴀᴛ.
• /ᴜɴᴘɪɴᴀʟʟ: Uɴᴘɪɴs ᴀʟʟ ᴛʜᴇ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ ɪɴ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴄʜᴀᴛ.
• /ᴀɴᴛɪᴄʜᴀɴɴᴇʟᴘɪɴ <ᴏɴ/ᴏғғ/ʏᴇs/ɴᴏ>: Tᴏɢɢʟᴇ ᴀɴᴛɪᴄʜᴀɴɴᴇʟᴘɪɴ sᴛᴀᴛᴜs. Aʟʟ ᴛʜᴇ ᴍᴇssᴀɢᴇs ғʀᴏᴍ ʟɪɴᴋᴇᴅ ᴄʜᴀɴɴᴇʟ ᴡɪʟʟ ʙᴇ ᴜɴᴘɪɴɴᴇᴅ ɪғ ᴇɴᴀʙʟᴇᴅ!
• /ᴄʟᴇᴀɴʟɪɴᴋᴇᴅ <ᴏɴ/ᴏғғ/ʏᴇs/ɴᴏ>: Tᴏɢɢʟᴇ ᴄʟᴇᴀɴʟɪɴᴋᴇᴅ sᴛᴀᴛᴜs. Aʟʟ ᴛʜᴇ ᴍᴇssᴀɢᴇs ғʀᴏᴍ ʟɪɴᴋᴇᴅ ᴄʜᴀɴɴᴇʟ ᴡɪʟʟ ʙᴇ ᴅᴇʟᴇᴛᴇᴅ ɪғ ᴇɴᴀʙʟᴇᴅ!
• /ᴘᴇʀᴍᴀᴘɪɴ <ᴛᴇxᴛ>: Pɪɴ ᴀ ᴄᴜsᴛᴏᴍ ᴍᴇssᴀɢᴇs ᴠɪᴀ ʙᴏᴛ. Tʜɪs ᴍᴇssᴀɢᴇ ᴄᴀɴ ᴄᴏɴᴛᴀɪɴ ᴍᴀʀᴋᴅᴏᴡɴ, ᴀɴᴅ ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ɪɴ ʀᴇᴘʟɪᴇs ᴛᴏ ᴛʜᴇ ᴍᴇᴅɪᴀ ɪɴᴄʟᴜᴅᴇ ᴀᴅᴅɪᴛɪᴏɴᴀʟ ʙᴜᴛᴛᴏɴs ᴀɴᴅ ᴛᴇxᴛ."""
